import { AppTexts } from "./types";

export const ru: AppTexts = {
  hero: {
    title: "CUBANTAXIS",
    subtitle: "Безопасные и надежные трансферы, городские туры и экскурсии по всей Кубе. Быстрое бронирование и персонализированный сервис.",
    buttons: {
      excursions: "Экскурсии",
      destinations: "Направления",
      fastBooking: "Быстрое Бронирование",
    },
  },
  bookingForm: {
    fullName: "Полное Имя",
    email: "Эл. почта",
    phone: "Телефон",
    vehicleType: "Тип Транспортного Средства",
    from: "Откуда",
    to: "Куда",
    date: "Дата",
    time: "Время",
    passengers: "Пассажиры",
    luggage: "Багаж",
    details: "Дополнительные Детали",
    attachImages: "Прикрепить Изображения",
    reserveNow: "Забронировать",
  },
  quickBookingForm: {
    phone: "Телефон",
    vehicleType: "Тип Транспортного Средства",
    from: "Откуда",
    to: "Куда",
    date: "Дата",
    time: "Время",
    passengers: "Пассажиры",
    luggage: "Описание багажа",
    reserveNow: "Забронировать",
  },
  destinationsCard: {
    subTitle:"Lugares a visitar en cuba",

    title: "Направления",
    description: "Откройте для себя наши самые популярные направления.",
  },
  excursionsCard: {
    title: "Экскурсии",
    places: "Включенные места",
  },
  footer: {
    rights: "© 2025 Cubantaxis. Все права защищены.",
  },
  seeMore: "See more", header: {
    social: {
      facebook: "Подпишитесь на нас в Facebook",
      instagram: "Подпишитесь на нас в Instagram",
      whatsapp: "Свяжитесь с нами через WhatsApp"
    }
  },quickForm: {
  phone: "Телефон",
  from: "Откуда",
  to: "Куда",
  date: "Дата",
  time: "Время",
  vehicle: "Транспорт",
  passengers: "Пассажиры",
  luggage: "Багаж / Примечания",
  luggagePlaceholder: "2 чемодана и 1 рюкзак",
  bookViaWhatsapp: "Забронировать через WhatsApp",
  bookViaTelegram: "Забронировать через Telegram",
  requestTitle: "🚕 Запрос на быструю бронь",
  locations: ["Гавана", "Варадеро", "Виньялес", "Тринидад"],
  vehicles: ["Седан", "Вэн", "Внедорожник"]
}



};
